---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsRunWinderBeginWithStraight
source: html/85f8c0f5-ecc0-82f1-3b18-7d2020ff7626.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsRunWinderBeginWithStraight Property

"Begin with Straight Run": Winder begin with straight run

## Syntax (C#)
```csharp
public static ForgeTypeId StairsRunWinderBeginWithStraight { get; }
```